backend/models/form/Management.php

SELECT * FROM `car_management` WHERE `id`=3
---
    public static function getCarList($carId){
        return static::findOne(['id' => $carId]);//, 'status' => self::STATUS_ACTIVE

SELECT `id`, `name` FROM `car_management` WHERE `id`='4'
---
    public static function findByCarData($carId)
    {
        $data = static::find()->select(['id','name'])->where(['id'=>$carId])->asArray()->one();