backend/controllers/UserController.php

    public function actionBdcar(){
        Yii::$app->response->format = Response::FORMAT_JSON;
        if (Yii::$app->getRequest()->getIsPost()) {
            $id = Yii::$app->request->post('dataId');
            $value = Yii::$app->request->post('selectedValue');
            $oldCarId = Yii::$app->request->post('oldCarId');
            $model = User::findOne($id);
            if ($model !== null) {
                $model->bdcar = $value;
                if ($model->save()) {
                    //update old carid如果carid大于0则修改状态值，第一次则不修改
                    if ($oldCarId > 0) {
                        $modelo = Management::findOne($oldCarId);
                        $modelo->status = 0;
                        $modelo->save();
                    }
                    //update new carid
                    $modeln = Management::findOne($value);
                    $modeln->status = 1;
                    $modeln->save();
---
SELECT * FROM `car_user` WHERE `id`='2'
UPDATE `car_user` SET `password_hash`='$2y$13$QGR/ZfEKISgMDmPFnQ2r7.nY9u8lsdFc9bZFl0KiysRT6Qq34udtu', `bdcar`=NULL, `updated_at`=1696758247 WHERE `id`=2
SELECT * FROM `car_management` WHERE `id`='2'
UPDATE `car_management` SET `status`=0, `updated_at`=1696758247 WHERE `id`=2
SELECT * FROM `car_management` WHERE `id`=''
UPDATE `car_management` SET `status`=1, `updated_at`=1696758241 WHERE `id`=2