backend/views/user/index.php

                            'width' => '130',
                            'attribute' => 'idcard',
                        ],
                        [
                            'label' => '绑定车辆',
                            'format' => 'raw',
                            'value' => function ($model) {
                                    $selectOptions = ArrayHelper::map(\backend\models\form\Management::find()->select(['id', 'name'])->all(), 'id', 'name');//->where(['status'=>0])
                                    $selectOptions = ['' => '请选择'] + $selectOptions; // 添加一个空选项
                                    $selectedValue = $model->bdcar; // 获取model->bdcar的值
                                    $select = Html::dropDownList('bdcar', $selectedValue, $selectOptions, [
                                        'class' => 'form-control custom-select',
                                        'data-id' => $model->id, // 存储数据ID
                                        'data-carid' => $model->bdcar,
                                    ]);
                                return $select;
                            },
                        ],
---
SELECT `id`, `name` FROM `car_management`