common/models/User.php

SELECT `id`, `username` FROM `car_user` WHERE (`id`='3') AND (`status`=10)
---
    public static function findByUserid($userid)
    {
        $data = static::find()->select(['id','username'])->where(['id'=>$userid,'status'=>self::STATUS_ACTIVE])->asArray()->one();

SELECT * FROM `car_user` WHERE (`id`=3) AND (`status`=10)
---
    public static function findUseridByname($userid)
    {
        return static::findOne(['id' => $userid, 'status' => self::STATUS_ACTIVE]);