common/services/UserDetailsService.php

    public function getModel($id, array $options = [])
    {
        return UserDetails::findOne($id);
---
SELECT * FROM `car_user_details` WHERE `id`='5'