backend/views/management/index.php

SELECT * FROM `car_cartype` ORDER BY `id` DESC
SELECT * FROM `car_cartype`
---
                        ],
                        [
                            'attribute' =>'cartype_id',
                            'filter'    => Html::activeDropDownList($searchModel, 'cartype_id',ArrayHelper::map(\backend\models\form\Cartype::find()->orderBy('id desc')->all(),'id','type_name')      , ['prompt' => '全部', "class" => "form-control "]),
                            'value'     => function ($data){
                                if(!empty($data->cartype_id)){
                                    return ArrayHelper::map(\backend\models\form\Cartype::find()->all(),'id','type_name')[trim($data->cartype_id)];